Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_uart_type_unify.h
/**************************************************************************//**
 * @defgroup UART_SCR
 * @brief  Scratch Pad Register                      (@ 0X01C)
 * @{
 *****************************************************************************/
#define UART_SHIFT_XFACTOR_ADJ                       16
#define UART_MASK_XFACTOR_ADJ                        ((u32)0x000007FF << 16)                             /*!<R/W 0  One factor of Baud rate calculation, i.e., the ovsr_adj[10:0] of following formula. */
#define UART_SHIFT_DBG_SEL                           8
#define UART_MASK_DBG_SEL                            ((u32)0x0000000F << 8)                              /*!<R/W 0  Debug port selection */
#define UART_SHIFT_RX_BREAK_INT_STS                  7
#define UART_BIT_RX_BREAK_INT_STS                    ((u32)0x00000001 << 7)                              /*!<R/W 0  rx break signal interrupt status. Write one clear. */
#define UART_SHIFT_RX_BREAK_INT_EN                   6
#define UART_BIT_RX_BREAK_INT_EN                     ((u32)0x00000001 << 6)                              /*!<R/W 0  rx break signal interrupt enable */
#define UART_SHIFT_FL_SET_BI_ERR                     5
#define UART_BIT_FL_SET_BI_ERR                       ((u32)0x00000001 << 5)                              /*!<R 1   */
#define UART_SHIFT_FL_FRAME_ERR                      4
#define UART_BIT_FL_FRAME_ERR                        ((u32)0x00000001 << 4)                              /*!<R 1   */
#define UART_SHIFT_PIN_LB_TEST                       3
#define UART_BIT_PIN_LB_TEST                         ((u32)0x00000001 << 3)                              /*!<R/W 0  For uart IP txd/rxd/rts/cts pin loopback test */
/** @} */

/**************************************************************************//**
 * @defgroup UART_STSR
 * @brief  STS Register                              (@ 0X020)
 * @{
 *****************************************************************************/
#define UART_SHIFT_RXFIFO_TRIGGER_LEVEL_STATUS       27
#define UART_MASK_RXFIFO_TRIGGER_LEVEL_STATUS        ((u32)0x00000003 << 27)                             /*!<R b'11  rxfifo_trigger_level in FCR bit[7:6], Define the 32-entries Receiver FIFO Interrupt trigger level 0~31 bytes 00: 1 byte 01: 8 bytes 10: 16 bytes 11: 28 bytes (for some device detect RTS de-assertion slower, reserve more RX FIFO space to prevent RX FIFO overflow ) */
#define UART_SHIFT_TXFIFO_LOW_LEVEL_STATUS           26
#define UART_BIT_TXFIFO_LOW_LEVEL_STATUS             ((u32)0x00000001 << 26)                             /*!<R 0  txfifo_low_level in FCR bit[5], Define the Transmission FIFO Low Water Level Interrupt trigger. 0: 4 byte 1: 8 bytes */
#define UART_SHIFT_FIFO_EN_STATUS                    25
#define UART_BIT_FIFO_EN_STATUS                      ((u32)0x00000001 << 25)                             /*!<R 1  fifo_en field of FCR bit[0] */
#define UART_SHIFT_DMA_MODE_STATUS                   24
#define UART_BIT_DMA_MODE_STATUS                     ((u32)0x00000001 << 24)                             /*!<R 1  dma_mode field of FCR bit[3] */
#define UART_SHIFT_XFACTOR                           4
#define UART_MASK_XFACTOR                            ((u32)0x0000000F << 4)                              /*!<R/W 0xb  Factor of Baud rate calculation, i.e., the ovsr[3:0] of following formula. */
#define UART_SHIFT_RESET_RCV                         3
#define UART_BIT_RESET_RCV                           ((u32)0x00000001 << 3)                              /*!<R/W 0  Reset Uart Receiver */
/** @} */

/**************************************************************************//**
 * @defgroup UART_RBR
 * @brief  Receiver Buffer Register                  (@ 0X024)
 * @{
 *****************************************************************************/
#define UART_SHIFT_RXDATA                            0
#define UART_MASK_RXDATA                             ((u32)0x000000FF << 0)                              /*!<R 0  Rx data. Note: Bit 0 is the least significant bit. It is the first bit serially received. */
/** @} */

/**************************************************************************//**
 * @defgroup UART_THR
 * @brief  Transmitter Holder Register               (@ 0X024)
 * @{
 *****************************************************************************/
#define UART_SHIFT_TXDATA                            0
#define UART_MASK_TXDATA                             ((u32)0x000000FF << 0)                              /*!<W 0  Tx data. Note: Bit 0 is the least significant bit. It is the first bit serially transmitted. */
/** @} */

/**************************************************************************//**
 * @defgroup UART_MISCR
 * @brief  MISC Control Register                     (@ 0X028)
 * @{
 *****************************************************************************/
#define UART_SHIFT_IRDA_RX_INV                       15
#define UART_BIT_IRDA_RX_INV                         ((u32)0x00000001 << 15)                             /*!<R/W 0  Invert irda_rx_i when 1; Default is 0; Note: Default IRDA RX pulse is Low Active */
#define UART_SHIFT_IRDA_TX_INV                       14
#define UART_BIT_IRDA_TX_INV                         ((u32)0x00000001 << 14)                             /*!<R/W 0  Invert irda_tx_o when 1; Default is 0; Note: Default IRDA TX Pulse is High Active */
#define UART_SHIFT_RXDMA_BURSTSIZE                   8
#define UART_MASK_RXDMA_BURSTSIZE                    ((u32)0x0000003F << 8)                              /*!<R/W 0x4  Rxdma burstsize */
#define UART_SHIFT_TXDMA_BURSTSIZE                   3
#define UART_MASK_TXDMA_BURSTSIZE                    ((u32)0x0000001F << 3)                              /*!<R/W 0x4  Txdma burstsize */
#define UART_SHIFT_RXDMA_EN                          2
#define UART_BIT_RXDMA_EN                            ((u32)0x00000001 << 2)                              /*!<R/W 1  1: rxdma is enabled (valid when dma_mode in FCR is 1'b1) 0: rxdma is disabled  */
#define UART_SHIFT_TXDMA_EN                          1
#define UART_BIT_TXDMA_EN                            ((u32)0x00000001 << 1)                              /*!<R/W 1  1: txdma is enabled (valid when dma_mode in FCR is 1'b1) 0: txdma is disabled */
#define UART_SHIFT_IRDA_ENABLE                       0
#define UART_BIT_IRDA_ENABLE                         ((u32)0x00000001 << 0)                              /*!<R/W 0  1: UART is co-work with IRDA SIR mode. i.e., txd/rxd are irda signals 0: UART mode only. */
/** @} */

/**************************************************************************//**
 * @defgroup UART_TXPLSR
 * @brief  IRDA SIR TX Pulse Width Control 0 Register (@ 0X02C)
 * @{
 *****************************************************************************/
#define UART_SHIFT_UPPERBOUND_SHIFTRIGHT             31
#define UART_BIT_UPPERBOUND_SHIFTRIGHT               ((u32)0x00000001 << 31)                             /*!<R/W 0  0: shift left (minus offset value of txplsr[30:16]) 1: shift right (plus offset value txplsr[30:16]) */
#define UART_SHIFT_TXPULSE_UPPERBOUND_SHIFTVAL       16
#define UART_MASK_TXPULSE_UPPERBOUND_SHIFTVAL        ((u32)0x00007FFF << 16)                             /*!<R/W 0  The shift value of SIR tx pulse's right edge position. The nominal IRDA SIR tx pulse width is 3/16 bit time. If want to increase or decrease the right edge position of tx pulse then must change this value. Note: In time unit of uart clock period. Nominally the 10ns.(100Mhz uart clk) */
#define UART_SHIFT_LOWBOUND_SHIFTRIGHT               15
#define UART_BIT_LOWBOUND_SHIFTRIGHT                 ((u32)0x00000001 << 15)                             /*!<R/W 0  0: shift left (minus offset value of txplsr[14:0]) 1: shift right (plus offset value txplsr[14:0]) */
#define UART_SHIFT_TXPULSE_LOWBOUND_SHIFTVAL         0
#define UART_MASK_TXPULSE_LOWBOUND_SHIFTVAL          ((u32)0x00007FFF << 0)                              /*!<R/W 0  The shift value of SIR tx pulse's left edge position The nominal IRDA SIR tx pulse width is 3/16 bit time. If want to increase or decrease the left edge position of tx pulse then must change the value. Note: In time unit of uart clock period. Nominally the 10ns.(100Mhz uart clk) */
/** @} */

/**************************************************************************//**
 * @defgroup UART_DBG_UART
 * @brief  Debug Register                            (@ 0X03C)
 * @{
 *****************************************************************************/
#define UART_SHIFT_DBG_UART                          0
#define UART_MASK_DBG_UART                           ((u32)0xFFFFFFFF << 0)                              /*!<R 0  dbg_urt[31:0]: debug port output value, depend on dbg_sel value in SCR[2:0] */
/** @} */

/**************************************************************************//**
 * @defgroup UART_RFCR
 * @brief  RX Filter Control Register                (@ 0X040)
 * @{
 *****************************************************************************/
#define UART_SHIFT_RF_EN                             7
#define UART_BIT_RF_EN                               ((u32)0x00000001 << 7)                              /*!<R/W 0  RX Filter enable control 0: Disable 1: Enable */
#define UART_SHIFT_RF_CMP_OP                         2
#define UART_MASK_RF_CMP_OP                          ((u32)0x00000003 << 2)                              /*!<R/W 0  Set the RX filter comparing rule. The ''matched'' condition is listed as following table: RF_LEN = 0: RF_CMP_OP = 0 (AND) 1st byte = Magic Pattern1 1 (OR) (1st byte = Magic Pattern1) OR (1st byte = Magic Pattern2) 2 (XOR) (1st byte != Magic Pattern1) AND (1st byte != Magic Pattern2) RF_LEN = 1: RF_CMP_OP = 0 (AND) (1st byte = Magic Pattern1) AND (2nd byte = Magic Pattern2) 1 (OR) (2nd byte = Magic Pattern1) OR (2nd byte = Magic Pattern2) 2 (XOR) (1st byte != Magic Pattern1) AND (2nd byte != Magic Pattern2) */
#define UART_SHIFT_RF_MASK_EN                        1
#define UART_BIT_RF_MASK_EN                          ((u32)0x00000001 << 1)                              /*!<R/W 0  Enable the mask operation for received data. 0: No mask, compare the received bytes with the magic pattern directly. 1: Mask enabled, received data needs to ''AND'' with mask value before it to be compared with magic pattern. */
#define UART_SHIFT_RF_LEN                            0
#define UART_BIT_RF_LEN                              ((u32)0x00000001 << 0)                              /*!<R/W 0  Set the length of received data to be check. 0: Check the first 1 received byte only. 1: Check the first 2 received bytes. */
/** @} */

/**************************************************************************//**
 * @defgroup UART_RFMPR
 * @brief  RX Filter Magic Pattern Register          (@ 0X044)
 * @{
 *****************************************************************************/
#define UART_SHIFT_RF_MP2                            8
#define UART_MASK_RF_MP2                             ((u32)0x000000FF << 8)                              /*!<R/W 0  The magic pattern2 for the 2nd received byte checking. */
#define UART_SHIFT_RF_MP1                            0
#define UART_MASK_RF_MP1                             ((u32)0x000000FF << 0)                              /*!<R/W 0  The magic pattern1 for the 1st received byte checking. */
/** @} */

/**************************************************************************//**
 * @defgroup UART_RFMVR
 * @brief  RX Filter Mask Value Register             (@ 0X048)
 * @{
 *****************************************************************************/
#define UART_SHIFT_RF_MV2                            8
#define UART_MASK_RF_MV2                             ((u32)0x000000FF << 8)                              /*!<R/W 0xFF  The mask value for the 2nd received byte. */
#define UART_SHIFT_RF_MV1                            0
#define UART_MASK_RF_MV1                             ((u32)0x000000FF << 0)                              /*!<R/W 0xFF  The mask value for the 1st received byte. */
/** @} */

/**************************************************************************//**
 * @defgroup UART_RFTOR
 * @brief  RX Filter Timeout Register                (@ 0X04C)
 * @{
 *****************************************************************************/
#define UART_SHIFT_RF_TIMEOUT                        0
#define UART_MASK_RF_TIMEOUT                         ((u32)0x000FFFFF << 0)                              /*!<R/W 0  Set the timeout value of the RX filter idle detection. This value is number of ticks. A tick time is equal to a UART bit time. */
/** @} */

/**************************************************************************//**
 * @defgroup UART_RFLVR
 * @brief  RX FIFO Level Register                    (@ 0X050)
 * @{
 *****************************************************************************/
#define UART_SHIFT_RX_FIFO_LV                        0
#define UART_MASK_RX_FIFO_LV                         ((u32)0x0000003F << 0)                              /*!<R 0  The level of the RX FIFO. This value indicates the number of data bytes in the RX FIFO.  */
/** @} */

/**************************************************************************//**
 * @defgroup UART_TFLVR
 * @brief  TX FIFO Level Register                    (@ 0X054)
 * @{
 *****************************************************************************/
#define UART_SHIFT_TX_FIFO_LV                        0
#define UART_MASK_TX_FIFO_LV                         ((u32)0x0000001F << 0)                              /*!<R 0  The level of the TX FIFO. This value indicates the number of data bytes in the TX FIFO.  */
/** @} */

/**************************************************************************//**
 * @defgroup UART_VISR
 * @brief  Vendor Interrupt Status Register          (@ 0X058)
 * @{
 *****************************************************************************/
#define UART_SHIFT_RX_IDLE_TIMEOUT_INT_STS           3
#define UART_BIT_RX_IDLE_TIMEOUT_INT_STS             ((u32)0x00000001 << 3)                              /*!<R/W1C 0  This bit indicate the receiver idle timeout interrupt pending status. Write 1 to this bit will clear the pending status. */
#define UART_SHIFT_TX_FIFO_LV_INT_STS                2
#define UART_BIT_TX_FIFO_LV_INT_STS                  ((u32)0x00000001 << 2)                              /*!<R/W1C 0  This bit indicates the interrupt pending status of the TX FIFO water level equal to the level setting. The software can use this interrupt to know the TX FIFO water level is low and refill the TX FIFO. To enable this interrupt, IER bit[5] should be written as 1. Write 1 to this bit will clear the pending status. */
#define UART_SHIFT_RF_IDLE_TIMEOUT_INT_STS           1
#define UART_BIT_RF_IDLE_TIMEOUT_INT_STS             ((u32)0x00000001 << 1)                              /*!<R/W1C 0  This bit indicates the interrupt pending status of the RX filter timeout occurred. The RX idle detection mechanism is used to check whether the receiving is in idle state for re-aquire pattern matching. This mechanism uses a timer to monitor new data receiving. This timer will reload the initial value whenever a new byte is received. If the timeout occurred (timer value countdown to 0), the RX filter will be reset to the initialed state and restart the first received 1 or 2 bytes checking. */
#define UART_SHIFT_RF_PATT_MATCH_INT_STS             0
#define UART_BIT_RF_PATT_MATCH_INT_STS               ((u32)0x00000001 << 0)                              /*!<R/W1C 0  The interrupt status of RX filter pattern checking matched. Write 1 to clear this interrupt status. 0: Interrupt is not pending. 1: Interrupt is pending. */
/** @} */

/**************************************************************************//**
 * @defgroup UART_VIER
 * @brief  Vendor Interrupt Enabling Control Register (@ 0X05C)
 * @{
 *****************************************************************************/
#define UART_SHIFT_RX_IDLE_TIMEOUT_INT_EN            3
#define UART_BIT_RX_IDLE_TIMEOUT_INT_EN              ((u32)0x00000001 << 3)                              /*!<R/W 0  The RX idle timeout interrupt enabling control: 1: enable 0: disable */
#define UART_SHIFT_TX_FIFO_LV_INT_EN                 2
#define UART_BIT_TX_FIFO_LV_INT_EN                   ((u32)0x00000001 << 2)                              /*!<R/W 0  The TX FIFO water level interrupt enabling control: 1: enable 0: disable */
#define UART_SHIFT_RF_IDLE_TIMEOUT_INT_EN            1
#define UART_BIT_RF_IDLE_TIMEOUT_INT_EN              ((u32)0x00000001 << 1)                              /*!<R/W 0  The Rx filter idle timeout interrupt enabling control: 1: enable 0: disable */
#define UART_SHIFT_RF_PATT_MATCH_INT_EN              0
#define UART_BIT_RF_PATT_MATCH_INT_EN                ((u32)0x00000001 << 0)                              /*!<R/W 0  The Rx filter pattern matched interrupt enabling control: 1: enable 0: disable */
/** @} */

/**************************************************************************//**
 * @defgroup UART_RITOR
 * @brief  RX Idle Timeout Register                  (@ 0X060)
 * @{
 *****************************************************************************/
#define UART_SHIFT_RX_IDLE_TIMEOUT_EN                31
#define UART_BIT_RX_IDLE_TIMEOUT_EN                  ((u32)0x00000001 << 31)                             /*!<R/W 0  RX idle timeout enable, default 0. */
#define UART_SHIFT_RXIDLE_TIMEOUT_VALUE              0
#define UART_MASK_RXIDLE_TIMEOUT_VALUE               ((u32)0x0000000F << 0)                              /*!<R/W 0  Time unit is the duration of a UART bit, depends on the baud-rate setting. Default 0. 0: 8 bit time. (1*8) 1: 16 bit time. (2*8) 2: 32 bit time. (2^2*8) 3: 64 bit time. (2^3*8) 4: 128 bit time. (2^4*8) 5: 256 bit time. (2^5*8) 6: 512 bit time. (2^6*8) 7: 1024 bit time. (2^7*8) 8: 2048 bit time. (2^8*8) 9: 4096 bit time. (2^9*8) 10: 8192 bit time. (2^10*8) 11: 16384 bit time. (2^11*8) 12: 32768 bit time. (2^12*8) 13: 65535 bit time. (2^13*8) 14: 131072 bit time. (2^14*8) 15: 262144 bit time. (2^15*8)  */
/** @} */

/**************************************************************************//**
 * @defgroup rtl8735b_UART
 * @{
 * @brief rtl8735b_UART Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t UART_DLLR ;                              /*!<  Divisor Latch (LS) Register register,  Address offset: 0x000 */
	__IO uint32_t UART_DLMR ;                              /*!<  Divisor Latch (MS) Register register,  Address offset: 0x004 */
	__IO uint32_t UART_IER ;                               /*!<  Interrupt Enable Register register,  Address offset: 0x004 */
	__I  uint32_t UART_IIR ;                               /*!<  Interrupt Identification Register register,  Address offset: 0x008 */
	__O  uint32_t UART_FCR ;                               /*!<  FIFO Control Register register,  Address offset: 0x008 */
	__IO uint32_t UART_LCR ;                               /*!<  Line Control Register register,  Address offset: 0x00C */
	__IO uint32_t UART_MCR ;                               /*!<  Modem Control Register register,  Address offset: 0x010 */
	__I  uint32_t UART_LSR ;                               /*!<  Line Status Register register,  Address offset: 0x014 */
	__I  uint32_t UART_MSR ;                               /*!<  Modem Status Register register,  Address offset: 0x018 */
	__IO uint32_t UART_SCR ;                               /*!<  Scratch Pad Register register,  Address offset: 0x01C */
	__IO uint32_t UART_STSR ;                              /*!<  STS Register register,  Address offset: 0x020 */
	__I  uint32_t UART_RBR ;                               /*!<  Receiver Buffer Register register,  Address offset: 0x024 */
	__O  uint32_t UART_THR ;                               /*!<  Transmitter Holder Register register,  Address offset: 0x024 */
	__IO uint32_t UART_MISCR ;                             /*!<  MISC Control Register register,  Address offset: 0x028 */
	__IO uint32_t UART_TXPLSR ;                            /*!<  IRDA SIR TX Pulse Width Control 0 Register register,  Address offset: 0x02C */
	__IO uint32_t RSVD0[3];                                /*!<  Reserved,  Address offset:0x30-0x38 */
	__I  uint32_t UART_DBG_UART ;                          /*!<  Debug Register register,  Address offset: 0x03C */
	__IO uint32_t UART_RFCR ;                              /*!<  RX Filter Control Register register,  Address offset: 0x040 */
	__IO uint32_t UART_RFMPR ;                             /*!<  RX Filter Magic Pattern Register register,  Address offset: 0x044 */
	__IO uint32_t UART_RFMVR ;                             /*!<  RX Filter Mask Value Register register,  Address offset: 0x048 */
	__IO uint32_t UART_RFTOR ;                             /*!<  RX Filter Timeout Register register,  Address offset: 0x04C */
	__IO uint32_t UART_RFLVR ;                             /*!<  RX FIFO Level Register register,  Address offset: 0x050 */
	__IO uint32_t UART_TFLVR ;                             /*!<  TX FIFO Level Register register,  Address offset: 0x054 */
	__IO uint32_t UART_VISR ;                              /*!<  Vendor Interrupt Status Register register,  Address offset: 0x058 */
	__IO uint32_t UART_VIER ;                              /*!<  Vendor Interrupt Enabling Control Register register,  Address offset: 0x05C */
	__IO uint32_t UART_RITOR ;                             /*!<  RX Idle Timeout Register register,          Address offset: 0x060 */
} UART_TypeDef;
/** @} */

#endif
